#+INCLUDE: "preamble.org"

#+TITLE: Medium Access Control 
#+AUTHOR: Mo, Yilin
#+DATE: Oct 2020 

#+KEYWORDS: Medium Access Control
#+DESCRIPTION: MAC layer for iot course

#+BEGIN_SRC ipython :session :exports none
from bokeh.resources import CDN
from bokeh.plotting import figure, show
from bokeh.embed import autoload_static
from bokeh.layouts import gridplot
from bokeh.models import Range1d, Label
from numpy import *
from bokeh.palettes import Category10_10

width = 1200
height = 600


def step_func(x, x0, y0):
    index = argsort(abs(x - 0.5 - x0))[0]
    return y0[index]
#+END_SRC

#+RESULTS:
: # Out[2]:
** The Collision Problem in Wireless Communications

- Two nodes send to the same node at the same time
- Interference of data: data loss

#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/collision.js"
p = figure(title="Collision", plot_width = width, plot_height = height//2)

x = [1, 2, 3, 6]
y = [1, 2, 1,  1]
for i in range(len(x)):
    p.rect(x[i],y[i],width=0.9,height=0.5, fill_color="#ffffff")
x =  [4.5, 5]
y =  [2, 1]

for i in range(len(x)):
    p.rect(x[i],y[i],width=0.9,height=0.5, fill_color="#ff0000")
p.xaxis.axis_label = "Time"
p.xgrid.visible = False
p.ygrid.visible = False
p.yaxis.ticker = [1, 2]
p.yaxis.major_label_overrides = {1: 'Node 1', 2: 'Node 2'}
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/collision.js" id="fab7a758-e774-46ff-b235-7fbbed0be040"></script>
#+end_export

*** Slotted ALOHA
#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/alohatimeslot.js"
p = figure(title="Slotted ALOHA", plot_width = width, plot_height = height)

x = [0, 1, 3, 4, 5, 7, 8, 9 ]
for i in range(len(x)):
    p.rect(x[i]+0.5, random.randint(5)+1 ,width=0.9,height=0.5, fill_color="#ffffff")
x = [2, 6 ]
for i in range(len(x)):
    y = random.randint(5)
    p.rect(x[i]+0.5, y + 1 ,width=0.9,height=0.5, fill_color="#888888")
    y += random.randint(4) + 1
    y %= 5
    p.rect(x[i]+0.5, y+1 ,width=0.9,height=0.5, fill_color="#888888")
    
p.xaxis.axis_label = "Time"
p.ygrid.visible = False
p.yaxis.ticker = [1,2,3,4,5]
p.xaxis.ticker = [1,2,3,4,5,6,7,8,9,10]
p.yaxis.major_label_overrides = {1: 'Node 1', 2: 'Node 2', 3:'Node 3', 4: 'Node 4', 5: 'Node 5'}

js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/alohatimeslot.js" id="e7c3d856-8d97-48f1-b417-48be8645a812"></script>
#+end_export

*** Throughput of Slotted ALOHA 

#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/slottedaloha.js"

x = linspace(0,5,100)
y = x*exp(-x)
p = figure(title = "Throughput of Slotted ALOHA", plot_width = width, plot_height = height )
p.line(x, y, line_width=2)
p.x_range=Range1d(0, 5.2)
p.xaxis.axis_label = "Rate of Transmission"
p.yaxis.axis_label = "Throughput"
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/slottedaloha.js" id="17b62b03-0d50-4e63-900b-c619680c1597"></script>
#+end_export

*** Throughput of Pure v.s. Slotted ALOHA 

#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/unslottedaloha.js"

x = linspace(0,5,100)
y = x*exp(-2*x)
p = figure(title = "Throughput of Pure v.s. Slotted ALOHA", plot_width = width, plot_height = height )
p.line(x, y, line_width=2)
y = x*exp(-x)
p.line(x, y, line_width=2, color="#ff0000")
p.x_range=Range1d(0, 5.2)
p.xaxis.axis_label = "Rate of Transmission"
p.yaxis.axis_label = "Throughput"
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/unslottedaloha.js" id="dd1e9106-9d36-41b9-b377-20403122d7dc"></script>
#+end_export

*** Hidden Terminal Problem

- Partially solves the hidden node problem
  - A sends RTS to B, and B sends CTS back
  - C, although *CANNOT* hear RTS from A, can hear CTS from B
  - C knows that there is a hidden terminal (B) and back-off for a random amount of time
    
#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/rtscts.js"
p = figure(title="Hidden Terminal", plot_width = width, plot_height = height//2)

p.rect(0.5, 3 ,width=0.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=0.5,y=3,text='RTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(1.5, 2 ,width=0.9,height=0.5, fill_color="#88ff88")
p.add_layout(Label(x=1.5,y=2,text='CTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(4.5, 3 ,width=4.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=4.5,y=3,text='Data Frame',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(7.5, 2 ,width=0.9,height=0.5, fill_color="#88ff88")
p.add_layout(Label(x=7.5,y=2,text='ACK',text_font_size='25px',text_align='center', y_offset=-15))
    
p.y_range=Range1d(0.5,3.5)
p.xaxis.axis_label = "Time"
p.xgrid.visible = False
p.yaxis.ticker = [1,2,3]
p.yaxis.major_label_overrides = {1: 'C', 2: 'B', 3:'A'}
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/rtscts.js" id="d9126410-077d-4ab0-8046-0b11c5d0e6c8"></script>
#+end_export

*** Exposed Terminal Problem
- Partially solves the exposed terminal problem
- If C receives the RTS from B but not the CTS from A
  - C knows that it can transmit to D and A *CANNOT* hear it
- However, CTS from A maybe lost due to other reasons
#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/rtscts2.js"
p = figure(title="Exposed Terminal", plot_width = width, plot_height = height//2)

p.rect(0.5, 2 ,width=0.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=0.5,y=2,text='RTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(1.5, 3 ,width=0.9,height=0.5, fill_color="#88ff88")
p.add_layout(Label(x=1.5,y=3,text='CTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(4.5, 2 ,width=4.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=4.5,y=2,text='Data Frame',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(7.5, 3 ,width=0.9,height=0.5, fill_color="#88ff88")
p.add_layout(Label(x=7.5,y=3,text='ACK',text_font_size='25px',text_align='center', y_offset=-15))

p.rect(2.5, 1 ,width=0.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=2.5,y=1,text='RTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(3.5, 0 ,width=0.9,height=0.5, fill_color="#88ff88")
p.add_layout(Label(x=3.5,y=0,text='CTS',text_font_size='25px',text_align='center', y_offset=-15))
p.rect(6.5, 1 ,width=4.9,height=0.5, fill_color="#ff8888")
p.add_layout(Label(x=6.5,y=1,text='Data Frame',text_font_size='25px',text_align='center', y_offset=-15))

    
p.y_range=Range1d(-0.5,3.5)
p.xaxis.axis_label = "Time"
p.xgrid.visible = False
p.yaxis.ticker = [0, 1,2,3]
p.yaxis.major_label_overrides = {0:'D', 1: 'C', 2: 'B', 3:'A'}
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/rtscts2.js" id="74901ef8-fef2-42a9-94ee-bd3b3680a621"></script>
#+end_export

*** Beacon Mode 

- PAN coordinator communication
  - Super-frame structure
    - 16 time slots
    - up to 7 time slots in the end of the super-frame can be guaranteed time slots
  - Inactive nodes including coordinator switch off their transceivers
- Data transfer with guaranteed time-slot
  - Device gets guaranteed time slots only if it sends request frames during contention access period
  - Device transmits immediately in time slot without carrier sense or collision avoiding
- Data transfer without guaranteed time-slot
  - Slotted CSMA-CA

    
#+BEGIN_SRC ipython :session :exports results :results output html :var filename="figures/802154beacon.js"
p = figure(title="IEEE 802.15.4 Super-frame", plot_width = width, plot_height = height//3)

p.rect(0.5,0.5,width=1,height=1, fill_color="#8888ff")
for x in range(1,9):
    p.rect(x+0.5,0.5,width=1,height=1, fill_color="#ff8888")
for x in range(9,16):
    p.rect(x+0.5,0.5,width=1,height=1, fill_color="#88ff88")

p.add_layout(Label(x=0.5,y=1,text='Beacon',text_font_size='25px',text_align='center' ))
p.add_layout(Label(x=4.5,y=1,text='Contention Access',text_font_size='25px',text_align='center' ))
p.add_layout(Label(x=12.5,y=1,text='Guaranteed Access',text_font_size='25px',text_align='center' ))

p.xaxis.axis_label = "Time"
p.xgrid.visible = False
p.ygrid.visible = False
p.yaxis.visible = False
p.y_range=Range1d(0, 1.5)
p.xaxis.ticker = [1, 9, 16]
show(p)
js, tag = autoload_static(p, CDN, filename)
f = open(filename, "w")
f.write(js)
f.close()

print(tag)
#+END_SRC

#+RESULTS:
#+begin_export html

<script src="figures/802154beacon.js" id="65d254ae-3f92-41b2-bb9e-8671bee5bc20"></script>
#+end_export

